app/controllers/backoffice/admins_controller.rb

INSERT INTO "admins" ("name", "email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @admin = Admin.new(params_admin)
    if @admin.save

UPDATE "admins" SET "role" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["role", 1], ["encrypted_password", "$2a$11$ff4Cx/IBwpRci28x/lCDqOkkAS//UCR3fnGjW/Q.LdjgA4fD9Oq5W"], ["updated_at", "2018-09-01 21:16:16.141826"], ["id", 2]]
---
  def update

    passwd = params[:admin][:password]
    passwd_confirmation = params[:admin][:password_confirmation]

    if passwd.blank? && passwd_confirmation.blank?
        params[:admin].delete(:password)
        params[:admin].delete(:password_confirmation)
    end

    if @admin.update(params_admin)

DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 12]]
---
  def destroy
    admin_name = @admin.name
    if @admin.destroy

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ?  ORDER BY "admins"."id" ASC LIMIT 1  [["id", 7]]
---
  def set_admin
    @admin = Admin.find(params[:id])