app/controllers/backoffice/categories_controller.rb

INSERT INTO "categories" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "teste"], ["created_at", "2018-05-12 19:18:44.369735"], ["updated_at", "2018-05-12 19:18:44.369735"]]
---
  def create
    @category = CategoryService.create(params_category)

UPDATE "categories" SET "description" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["description", "teste123"], ["updated_at", "2018-05-12 19:46:45.236530"], ["id", 11]]
---
  def update
    if @category.update(params_category)